TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/examples/c28x/memcfg/memcfg_ex1_error_handling.c
    if(errCountGlobal == 0x0)
    {
        testStatusGlobal = TEST_PASS;
    }

    //
    // Loop indefinitely
    //
    while(1)
    {
    }
}

//
// forceNonMasterDMAReadViolation - Force non-master DMA read access violation
// through software and demonstrate violation handling.
//
uint32_t forceNonMasterDMAReadViolation(void)
{
    uint32_t i, testPassCnt = 0U;

    //
    // Enable interrupt
    //
    MemCfg_enableViolationInterrupt(MEMCFG_NMVIOL_DMAREAD);

    //
    // Reset sys_int counter
    //
    sysIntErrCnt = 0;

    //
    // Force non-master DMA read violation through software
    //
    for(i = 0U; i < 5U; i++)
    {
        MemCfg_forceViolationInterrupt(MEMCFG_NMVIOL_DMAREAD);
    }

    while(sysIntErrCnt == 0U);
    if(sysIntErrCnt == 5U)
    {
        testPassCnt++;
    }


    //
    // Return status
    //
    if(testPassCnt == 1U)
    {
        return(0U);
    }
    else
    {
        return(1U);
    }
}

//
// generateParityMemUncorrError - Generate uncorrectable error in parity memory
// and demonstrate error handling in case of uncorr errors in parity memories.
// Note- Single bit error in parity memories generate uncorrectable errors.
//
uint32_t generateParityMemUncorrError()
{
    uint32_t i, memOffset;
    uint32_t readMemData = 0, testPassCnt = 0;
    uint32_t parityRead1 = 0, parityRead2 = 0;

    //
    // Clear uncorrectable error status.
    //
    MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD);

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_GS2);
    while(MemCfg_getInitStatus(MEMCFG_SECT_GS2) != 1U);

    //
    // Write to GS2 RAM - 0x14000-0x15FFF
    //
    writeCAFE(GS2_RAM_BASE, 0x15FFFU);

    //
    // Reset the error flag
    //
    uncorrErrIntFlg = 0U;

    //
    // Generating 5 uncorrectable errors at different memory locations
    //
    for(i = 0; i < 0x5U; i++)
    {
        //
        // Reset the error flag
        //
        uncorrErrIntFlg = 0U;

        //
        // Corrupting some random address
        //
        memOffset = 0x08U + (i * 8U);

        //
        // Set the memory in ECC write mode.
        //
        MemCfg_setTestMode(MEMCFG_SECT_GS2 ,MEMCFG_TEST_WRITE_PARITY);
        parityRead1 = HWREGH(GS2_RAM_BASE + memOffset);

        //
        // Set the memory in Data write mode & flip 2 bits in data to generate
        // uncorrectable error. Writing the data to memory in test mode
        // doesn't modify the ECC.
        //
        MemCfg_setTestMode(MEMCFG_SECT_GS2 ,MEMCFG_TEST_WRITE_DATA);
        HWREGH(GS2_RAM_BASE + memOffset) = HWREGH(GS2_RAM_BASE + memOffset) ^
                                           0x01;

        //
        // Go back to ECC write mode to confirm that ECC is not changed.
        //
        MemCfg_setTestMode(MEMCFG_SECT_GS2 ,MEMCFG_TEST_WRITE_PARITY);
        parityRead2 = HWREGH(GS2_RAM_BASE + memOffset);

        //
        // Go to functional mode and try to read data from memory to generate
        // uncorrectable error as 2 bits of data were flipped in data write
        // mode but ECC was unchanged.
        //
        MemCfg_setTestMode(MEMCFG_SECT_GS2 ,MEMCFG_TEST_FUNCTIONAL);
        readMemData = HWREGH(GS2_RAM_BASE + memOffset);

        while(uncorrErrIntFlg == 0x0U);

        //
        // Check whether uncorrectable error is getting generated at the
        // correct address or not.
        //
        if((readMemData != 0xCAFE) && (parityRead1 == parityRead2) &&
           (errorType & MEMCFG_UCERR_CPUREAD != 0) &&
           (errorAddress == GS2_RAM_BASE + memOffset))
        {
            testPassCnt++;
        }

        //
        // Write the correct data in memory. Application can choose to re-write the
        // whole memory region to avoid any possible data corruption using following:
        // writeCAFE(GS2_RAM_BASE, 0xFFFFU);
        //
        HWREGH(errorAddress) = 0xCAFE;
    }

    //
    // Return status
    //
    if(testPassCnt == 5)
    {
        return 0;
    }
    else
    {
        return 1;
    }
}

//
// generateECCMemUncorrError - Generate uncorrectable error in ECC memory &
// demonstrate the interrupt handling in case of uncorr error in ECC memories.
// Note - Double bit errors in ECC memories generate uncorrectable errors.
//
uint32_t generateECCMemUncorrError()
{
    uint32_t i, memOffset;
    uint32_t readMemData = 0, testPassCnt = 0;
    uint32_t eccRead1 = 0, eccRead2 = 0;

    //
    // Clear uncorrectable error status.
    //
    MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD);

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_M0);
    while(MemCfg_getInitStatus(MEMCFG_SECT_M0) != 1U);

    //
    // Write to M0 RAM - 0x0000-0x03FF
    //
    writeCAFE(M0_RAM_BASE, 0x3FFU);

    //
    // Reset the error flag
    //
    uncorrErrIntFlg = 0U;

    //
    // Generating 5 uncorrectable errors at some locations in memory
    //
    for(i = 0; i < 0x5U; i++)
    {
        //
        // Reset error flag which gets set in ISR
        //
        uncorrErrIntFlg = 0;

        //
        // Corrupting some random address
        //
        memOffset = 0x08U + (i * 8U);

        //
        // Set the memory in ECC write mode.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_ECC);
        eccRead1 = HWREGH(M0_RAM_BASE + memOffset);

        //
        // Set the memory in Data write mode & flip 2 bits in data to generate
        // uncorrectable error. Writing the data to memory in test mode
        // doesn't modify the ECC.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_DATA);
        HWREGH(M0_RAM_BASE + memOffset) = HWREGH(M0_RAM_BASE + memOffset) ^
                                           0x03;

        //
        // Go back to ECC write mode to confirm that ECC is not changed.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_PARITY);
        eccRead2 = HWREGH(M0_RAM_BASE + memOffset);

        //
        // Go to functional mode and try to read data from memory to generate
        // uncorrectable error as 2 bits of data were flipped in data write
        // mode but ECC was unchanged.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_FUNCTIONAL);
        readMemData = HWREGH(M0_RAM_BASE + memOffset);

        while(uncorrErrIntFlg == 0);

        //
        // Check whether uncorrectable error is getting generated at the
        // correct address or not.
        //
        if((readMemData != 0xCAFE) && (eccRead1 == eccRead2) &&
           (errorType & MEMCFG_UCERR_CPUREAD != 0) &&
           (errorAddress == M0_RAM_BASE + memOffset))
        {
            testPassCnt++;
        }

        //
        // Write the correct data in memory. Application can choose to re-write the
        // whole memory region to avoid any possible data corruption using following:
        // writeCAFE(M0_RAM_BASE, 0x03FFU);
        //
        HWREGH(errorAddress) = 0xCAFE;
    }

    //
    // Return status
    //
    if(testPassCnt == 5)
    {
        return 0;
    }
    else
    {
        return 1;
    }
}

//
// generateECCMemCorrError - Generate correctable error in ECC memory
// Note- Single bit errors in ECC memories generate correctable errors.
//
uint32_t generateECCMemCorrError()
{
    uint32_t i, memOffset;
    uint32_t readMemData = 0, testPassCnt = 0;
    uint32_t eccRead1 = 0, eccRead2 = 0;

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_M0);
    while(MemCfg_getInitStatus(MEMCFG_SECT_M0) != 1U);

    //
    // Write to M0 RAM - 0x0000 - 0x03FF
    //
    writeCAFE(M0_RAM_BASE, 0x3FFU);

    //
    // Clear correctable error status
    //
    MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);
    MemCfg_clearCorrErrorInterruptStatus(MEMCFG_CERR_CPUREAD);

    //
    // Set error threshold to generate interrupt after configured no of
    // correctable errors. Setting it to 1 to generate error on each error.
    //
    MemCfg_setCorrErrorThreshold(1U);

    //
    // Enable correctable errors at peripheral level
    //
    MemCfg_enableCorrErrorInterrupt(MEMCFG_CERR_CPUREAD);

    //
    // Clear sys_int counter
    //
    sysIntErrCnt = 0;

    //
    // Generating 5 correctable errors at some locations in memory
    //
    for(i = 0U; i < 0x5U; i++)
    {
        //
        // Reset the corr error count.
        //
        corrErrIntFlg = 0U;

        //
        //  Corrupting some random address
        //
        memOffset = 0x08U + (i * 8U);

        //
        // Set the memory in ECC write mode.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_ECC);
        eccRead1 = HWREGH(M0_RAM_BASE + memOffset);

        //
        // Set the memory in Data write mode & flip 1 bit in data to generate
        // correctable error. Writing the data to memory in test mode
        // doesn't modify the ECC.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_DATA);
        HWREGH(M0_RAM_BASE + memOffset) = HWREGH(M0_RAM_BASE + memOffset) ^
                                           0x02U;

        //
        // Go back to ECC write mode to confirm that ecc is not changed.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0, MEMCFG_TEST_WRITE_ECC);
        eccRead2 = HWREGH(M0_RAM_BASE + memOffset);

        //
        // Go to functional mode and try to read data from memory to generate
        // correctable error as 1 bits of data was flipped in data write
        // mode but ECC was unchanged.
        //
        MemCfg_setTestMode(MEMCFG_SECT_M0 ,MEMCFG_TEST_FUNCTIONAL);
        readMemData = HWREGH(M0_RAM_BASE + memOffset);

        while(corrErrIntFlg == 0U);
        if((eccRead1 == eccRead2) && (readMemData == 0xCAFE))
        {
            testPassCnt++;
        }
    }

    //
    // Return status
    //
    if(testPassCnt == 5)
    {
        return 0U;
    }
    else
    {
        return 1U;
    }
}

//
// generateNonMasterCPURdViolation - Generate non-master CPU read violation
//
uint32_t generateNonMasterCPURdViolation()
{
    uint32_t i, readMemData = 0, testPassCnt = 0;

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_LS6);
    while(MemCfg_getInitStatus(MEMCFG_SECT_LS6) != 1U);

    //
    // Write to LS6 RAM - 0xB000-0xB7FF
    //
    writeCAFE(LS6_RAM_BASE, 0xB7FFU);

    //
    // Enable violation interrupt
    //
    MemCfg_enableViolationInterrupt(MEMCFG_NMVIOL_CPUREAD);

    //
    // Memory is shared between CLA & CPU
    //
    MemCfg_setLSRAMControllerSel(MEMCFG_SECT_LS6, MEMCFG_LSRAMCONTROLLER_CPU_CLA1);

    //
    // Clear sys_int counter
    //
    sysIntErrCnt = 0;

    //
    // Memory is set as Data memory for CLA, hence CPU will have read access to
    // the memory. No violation will be raised
    //
    MemCfg_setCLAMemType(MEMCFG_SECT_LS6, MEMCFG_CLA_MEM_DATA);
    for(i = 0; i < 5; i++)
    {
        readMemData = HWREGH(LS6_RAM_BASE + (0x08 + (2 * i)));
        if(readMemData == 0xCAFE)
        {
            testPassCnt++;
        }
    }

    //
    // Set memory as program memory for CLA. Now the read access from CPU
    // will result in non-master CPU read violation.
    //
    MemCfg_setCLAMemType(MEMCFG_SECT_LS6, MEMCFG_CLA_MEM_PROGRAM);

    //
    // Reset the sys_int counter
    //
    sysIntErrCnt = 0U;

    //
    // Initiate CPU read from memory.
    //
    for(i = 0U; i < 5U; i++)
    {
        readMemData = HWREGH(LS6_RAM_BASE + (0x08U + (2U * i)));
    }
    while(sysIntErrCnt < 5U);
    testPassCnt++;

    //
    // Disable interrupt
    //
    MemCfg_disableViolationInterrupt(MEMCFG_NMVIOL_CPUREAD);

    //
    // Return status
    //
    if(testPassCnt == 6)
    {
        return 0U;
    }
    else
    {
        return 1U;
    }
}


//
// generateNonMasterCPUWrViolation - Generate non-master CPU write violation
//
uint32_t generateNonMasterCPUWrViolation()
{
    uint32_t i, testPassCnt = 0;

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_GS2);
    while(MemCfg_getInitStatus(MEMCFG_SECT_GS2) != 1U);

    //
    // Write to GS2 RAM - 0x14000-0x15FFF
    //
    writeCAFE(GS2_RAM_BASE, 0x15FFFU);

    //
    // Enable violation interrupt
    //
    MemCfg_enableViolationInterrupt(MEMCFG_NMVIOL_CPUWRITE);

    //
    // Set master of GS2 RAM to CPU2
    //
    MemCfg_setGSRAMControllerSel(MEMCFG_SECT_GS2, MEMCFG_GSRAMCONTROLLER_CPU2);

    //
    // Clear sys_int counter
    //
    sysIntErrCnt = 0;

    //
    // Write to memory will generate non-master CPU write violation as
    // master of GS2 RAM is set as CPU2.
    //
    for(i = 0; i < 5; i++)
    {
        HWREGH(GS2_RAM_BASE + (0x08 + (2 * i))) = 0xEFFFU;
    }

