TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/examples/c28x/memcfg/memcfg_ex1_error_handling.c
    while(sysIntErrCnt < 5U);
    testPassCnt++;

    //
    // Disable interrupt.
    //
    MemCfg_disableViolationInterrupt(MEMCFG_NMVIOL_CPUWRITE);

    //
    // Return status
    //
    if(testPassCnt == 1)
    {
        return 0U;
    }
    else
    {
        return 1U;
    }
}

//
// generateMasterCPUWrViolation - Generate Master CPU Write Violation
//
uint32_t generateMasterCPUWrViolation()
{
    uint32_t i, testPassCnt = 0U;

    //
    // Initialize memories & check if it is getting initialized
    //
    MemCfg_initSections(MEMCFG_SECT_GS2);
    while(MemCfg_getInitStatus(MEMCFG_SECT_GS2) != 1U);

    //
    // Write to GS2 RAM - 0x14000-0x15FFF
    //
    writeCAFE(GS2_RAM_BASE, 0x15FFFU);

    //
    // Enable violation interrupt
    //
    MemCfg_enableViolationInterrupt(MEMCFG_MVIOL_CPUWRITE);

    //
    // Set master of GS2 RAM to CPU1
    //
    MemCfg_setGSRAMControllerSel(MEMCFG_SECT_GS2, MEMCFG_GSRAMCONTROLLER_CPU1);

    //
    // Set write protection which generates master CPU-write violation in
    // case of CPU-writes.
    //
    MemCfg_setProtection(MEMCFG_SECT_GS2, MEMCFG_PROT_BLOCKCPUWRITE);

    //
    // Clear sys_int counter
    //
    sysIntErrCnt = 0;

    //
    // Write to memory will generate master CPU write violation as
    // CPU writes are blocked
    //
    for(i = 0U; i < 5U; i++)
    {
        HWREGH(GS2_RAM_BASE + (0x08U + (2U * i))) = 0xEFFFU;
    }

    while(sysIntErrCnt < 5U);
    testPassCnt++;
    MemCfg_disableViolationInterrupt(MEMCFG_MVIOL_CPUWRITE);

    //
    // Return status
    //
    if(testPassCnt == 1U)
    {
        return 0U;
    }
    else
    {
        return 1U;
    }
}


//
// sys_error interrupt ISR
//
__interrupt void sysErrorISR(void)
{
    sysIntErrCnt++;
    intStatus = MemCfg_getViolationInterruptStatus();
    if((intStatus & MEMCFG_NMVIOL_DMAREAD) != 0x0U)
    {
        //
        // Capture the address at which violation occurred
        //
        errorAddress = MemCfg_getViolationAddress(MEMCFG_NMVIOL_DMAREAD);

        //
        // Clear peripheral related flags
        //
        MemCfg_clearViolationInterruptStatus(MEMCFG_NMVIOL_DMAREAD);
    }
    if((intStatus & MEMCFG_NMVIOL_CPUREAD) != 0x0U)
    {
        //
        // Capture the address at which violation occurred
        //
        errorAddress = MemCfg_getViolationAddress(MEMCFG_NMVIOL_CPUREAD);

        //
        // Clear peripheral related flags
        //
        MemCfg_clearViolationInterruptStatus(MEMCFG_NMVIOL_CPUREAD);
    }
    if((intStatus & MEMCFG_NMVIOL_CPUWRITE) != 0x0U)
    {
        //
        // Capture the address at which violation occurred
        //
        errorAddress = MemCfg_getViolationAddress(MEMCFG_NMVIOL_CPUWRITE);

        //
        // Clear peripheral related flags
        //
        MemCfg_clearViolationInterruptStatus(MEMCFG_NMVIOL_CPUWRITE);
    }
    if((intStatus & MEMCFG_MVIOL_CPUWRITE) != 0x0U)
    {
        //
        // Capture the address at which violation occurred
        //
        errorAddress = MemCfg_getViolationAddress(MEMCFG_MVIOL_CPUWRITE);

        //
        // Clear peripheral related flags
        //
        MemCfg_clearViolationInterruptStatus(MEMCFG_MVIOL_CPUWRITE);
    }

    intStatus = MemCfg_getCorrErrorStatus();
    if((intStatus & MEMCFG_CERR_CPUREAD) != 0x0U)
    {
        corrErrIntFlg = 1U;

        //
        // Capture error address
        //
        errorAddress = MemCfg_getCorrErrorAddress(MEMCFG_CERR_CPUREAD);

        //
        // Clear flags at the memcfg peripheral side
        //
        MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);
        MemCfg_clearCorrErrorInterruptStatus(MEMCFG_CERR_CPUREAD);
    }

    //
    // Clear sysctl related flags
    //
    sysIntStatus = SysCtl_getInterruptStatus();
    SysCtl_clearInterruptStatus(sysIntStatus);

    //
    // Clear the interrupt at PIE level
    //
    Interrupt_clearACKGroup(INT_SYS_ERR >> 8U);
}

__interrupt void nmiISR(void)
{
    //
    // Capture error type
    //
    errorType = MemCfg_getUncorrErrorStatus();
    if(errorType & MEMCFG_UCERR_CPUREAD != 0x0U)
    {
        //
        // capture error address
        //
        errorAddress = MemCfg_getUncorrErrorAddress(MEMCFG_UCERR_CPUREAD);

        //
        // Clear the flag at peripheral level
        //
        MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD);
    }

    //
    // Clear NMI flags
    //
    intStatus = SysCtl_getNMIFlagStatus();
    SysCtl_clearNMIStatus(intStatus);

    //
    // Set the flag
    //
    uncorrErrIntFlg = 1U;
}

void writeCAFE(uint32_t startAddress, uint32_t endAddress)
{
    uint16_t* addr;
    for (addr = (uint16_t*)startAddress; addr <= (uint16_t*)endAddress; addr++)
    {
        *addr = 0xCAFE;
    }
}

//
// End of File
//
